// lib/data/worry_messages.dart

final Map<String, List<String>> positiveMessagesMap = {
  "야식 먹을까?": [
    "먹고 죽어야지 ㅋㅋ",
    "배고픈거 참어?",
    "먹으려고 사는거지 ㅋㅋ",
  ],
  "운동 갈까?": [
    "몸짱 드가자 ㅋㅋ",
    "올 여름 다 죽었다 ㅋㅋ",
    "사람들 다 꼬시겠네 ㅋㅋ",
  ],
  "공부할까?": [
    "조금만 더 하면 서울대 ㅇㅈ?",
    "이번 시험 백점 각이네 ㅋㅋ",
    "지금 공부하면 ㄹㅇ 기억에 남음",
  ],
  "지를까 말까?": [
    "사고싶으면 사야지 ㅋㅋ",
    "지금 사야 후회안한다?",
    "지금이야 결제해 ㅋㅋ",
  ],
  "한다 만다?": [
    "뭐가 됐던 일단 해",
    "해야할 때가 맞다.",
    "해라해라해라해라해라",
  ],
  "퇴사할까?": [
    "거지같은거 ㅋㅋ 때려친다.",
    "쉴때 되긴했다 ㅇㅈㅇㅈ",
    "딴데 가면 더 많이 받을 수 있음 ㅇㅈ",
  ],
  "나갈까?": [
    "콧구멍에 바람 쐬야지 ㅋㅋ",
    "일단 나가면 재밌음 ㅋㅋ",
    "나가야지 인생이지 ㅋㅋ",
  ],
  "잘까?": [
    "지금 자야 컨디션 좋음 ㄹㅇ",
    "자 눈 감자.",
    "지금 자야 로또 꿈 꾼다 ㅋㅋ",
  ],
  "다이어트 할까?": [
    "지금 해야 여름 다 부숨",
    "무조건 해야지 ㄹㅇ",
    "해라.",
  ],
};

final Map<String, List<String>> negativeMessagesMap = {
  "야식 먹을까?": [
    "지금 먹으면 1kg 찜 ㅋㅋ",
    "아~ 먹으면 안될걸~",
    "물 먹고 그냥 자자.",
  ],
  "운동 갈까?": [
    "쉴땐 쉬어야 근성장 됨",
    "오늘 쉬고 내일 풀컨디션 ㄱㄱ",
    "내일은 꼭 가라",
  ],
  "공부할까?": [
    "하루 쉰다고 안망한다.",
    "이거 누른 순간 하기 싫은거임ㅋㅋ",
    "리프레시 할 때 됐다 ㅇㅈ",
  ],
  "지를까 말까?": [
    "흠.. 좀 별론데 고민 좀",
    "지금 참으면 잔고가 안전함",
    "한번만 참자 ㅋㅋ",
  ],
  "한다 만다?": [
    "한번 더 고민 해",
    "아직은 때가 아니다.",
    "하지마하지마하지마",
  ],
  "퇴사할까?": [
    "잔고 확인 한번 하고 참자...",
    "다음 달까지만... 고민해보자",
    "뭐 할지 생각은 했어?",
  ],
  "나갈까?": [
    "솔직히 집이 최고다.",
    "침대가 최곤데 왜?",
    "나가서 뭐하려고 ㅋㅋ",
  ],
  "잘까?": [
    "쇼츠 각 ㄹㅇ ㅋㅋ",
    "릴스 각 ㄹㅇ ㅋㅋ",
    "이거 누른거면 잠 안오는거임 ㅋㅋ",
  ],
  "다이어트 할까?": [
    "먹는게 즐거운데 왜 해 ㅋㅋ",
    "지금? 굳이? 급해?",
    "아 ㅋㅋ 아직 보기에 괜찮음 ㄹㅇ",
  ],
};
